{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"LSTM","config":{"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true,"batch_input_shape":[null,100,127],"dtype":"float32"}},{"class_name":"RepeatVector","config":{"n":100,"name":"repeat_vector_RepeatVector1","trainable":true}},{"class_name":"LSTM","config":{"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM2","trainable":true}},{"class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":127,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},"name":"time_distributed_TimeDistributed1","trainable":true}},{"class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation1","trainable":true}}]},"keras_version":"tfjs-layers 1.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM1/kernel","shape":[127,512],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[512],"dtype":"float32"},{"name":"lstm_LSTM2/kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM2/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"lstm_LSTM2/bias","shape":[512],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/kernel","shape":[128,127],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/bias","shape":[127],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.0","convertedBy":null}